Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E18D.tmx
Source language: en_us
Languages: zh_cn

source: Fitness in Focus: How to maintain your exercise routine while traveling
zh_cn: 健身聚焦：如何在旅途中保持日常锻炼

source: Being on the go is not an excuse for slacking on your exercise commitment.
zh_cn: 别拿旅游当借口，疏忽了日常的例行锻炼。

source: Do you stop taking baths or showers?
zh_cn: 你难道会因为在旅途中就不刷牙不洗燥吗？

source: No of course not, you continue these daily habits no matter where you are if at all possible.
zh_cn: 当然不会，不论你在什么地方，你都会继续执行这些日常习惯。

source: So, why would you stop exercising?
zh_cn: 这样说来，你又有什么理由停止日常锻炼呢？

source: In fact, exercise is even more important while you are traveling because you want to improve blood flow, charge the metabolism and release good chemicals in the brain.
zh_cn: 事实上，当你旅行时，锻炼显得更加重要，因为你要提高血液流动速度，提高新陈代谢并释放大脑中的有益化学物质。

source: And finding ways to exercise is simpler and easier while traveling than you might think.
zh_cn: 而在旅途上，做一些锻炼是你能想到的最简单最容易的一个办法。

source: Instead of the same old boring routine you have at home, now you get to experience new surroundings and new activities while you are away.
zh_cn: 一成不变的枯燥例行锻炼并不是你的选择，此时身处新的环境中，就要做点新的活动。

source: Taking a walk or a run through a new area is stimulating and inspiring.
zh_cn: 散散步或者在陌生的地方跑一跑既刺激又振奋人心。

source: Exploring your new environment with your curious mind can propel you through a thirty minute jaunt effortlessly.
zh_cn: 开启你的好奇心探索身边的新事物，你就会发现三十分钟的远足并不要花多大力气。

source: Some places even offer new types of activities that would not normally be available to you at home like yoga, geocaching, swimming or mountain climbing. Get inspired and stay fit.
zh_cn: 有些地方甚至还会提供新活动项目，例如瑜伽，地理寻宝，有用或者爬山，这些都是你在家里做不到的，让你备受启发，身体健康。

source: If you are staying at a hotel with a fitness facility, this is your opportunity to try the latest equipment or equipment that you do not have at home.
zh_cn: 如果你住在提供健身设施的宾馆里，那么你就有机会尝试最新潮的或者家里没有的器材了。

source: Maybe you will find a piece of equipment that you really enjoy.
zh_cn: 或许你会找到一件你最爱的器材。

source: Maybe you will want one of your own.
zh_cn: 或许你会考虑回家后也去买一台。

source: Note the brand and when you get home, search for it in the used commercial fitness equipment market.
zh_cn: 记下牌子，当你回家后，就可以在二手商业健身器材市场中搜寻一下。

source: Take advantage of the fitness opportunities that your travels give you and do not forget to pack your workout clothes.
zh_cn: 好好利用旅途带给你锻炼身体的机会，也别忘了带上你的健身套装。

source: Even if you do not have a fitness facility where you are staying, you can still make fitness happen.
zh_cn: 即使你的住所不提供健身设施，你也可以找到锻炼身体的方法。

source: Once I saw a homeless man doing push-ups on a street corner.
zh_cn: 我曾看到一个无家可归的男人在街角做俯卧撑。

source: He was not there for money.
zh_cn: 他不是为了乞讨。

source: He was just giving himself a gift, the gift that exercise brings to the human body.
zh_cn: 仅仅是给自己一份礼物，运动就是给身体最好的礼物。

source: If a homeless man can find ways to exercise, so can you.
zh_cn: 连一个无家可归的男人都能给自己创造运动的机会，那么你也可以。

source: No fancy equipment required. Rain or shine. Where ever you are, you can work- out.
zh_cn: 不需要什么新颖时髦的器材，不论晴天或者大雨天，不论你在何地，你都可以做锻炼。

source: Get back to the basics: squats, sit-ups, push-ups, and even jumping jacks.
zh_cn: 从最基础的开始：深蹲起，仰卧起坐，俯卧撑，甚至展体跳跃也行。

source: This is not rocket science, this is exercise. And only you can make fitness happen, no matter where you are.
zh_cn: 这不是什么复杂的事情，就是做些锻炼嘛！不论你在哪里，要想保持健康，只能靠你自己。

source: On the beach, in a city, at an airport, or in a hotel room, your commitment to exercise should not fail you now.
zh_cn: 无论身处沙滩，城市，机场或者旅馆里，你都能完成坚持锻炼的承诺。

source: Now, more than ever, you need the exercise to burn those calories from eating unhealthy foods while you travel. (Unless, you have read my post about how to eat healthy foods while traveling)
zh_cn: 如今，你比任何时候都需要通过锻炼来燃烧在旅行中摄入的来自不健康食物的卡路里。（除非你已经读过了我写的关于如何在旅行装保持健康饮食的文章）。

source: You need exercise to drain your energy and boost the good chemicals in your brain.
zh_cn: 你需要锻炼消耗能量，促进大脑释放有益化学物质。

source: You will sleep better and you will feel better if you exercise while you travel.
zh_cn: 在旅行中保持锻炼会让你睡得更香，感觉更棒。
